#include <stdio.h>
#include <limits.h>

int main1()
{

#if 0
	printf("hello world");
#endif
	//一种新的注释方式
	//可用于内部已有注释
	//----------------------------------------------------




	//----------------------------------------------------
	// 
	//printf("%u", sizeof(struct Book));
	//c语言用结构标识符必须 struct X a;
	//C语言存储结构采用对齐(自然字节处理更快速)
	//4的整数(int大小
	//所以最大化利用内存先声明对齐严格的变量
	//如
	//struct 
	// {
	//		int a;
	//		char [18]; 
	// };
	// 输出为22
	// 
	//

	//getchar();
	//putchar('abcd');
	//getchar()和putchar()相对应
	//C语言允许''内包含多个字符(将字符视为int,所以可以占用多个字节)
	//所以表达式值应是最右字节的值
	//----------------------------------------------------


	//----------------------------------------------------
	putchar('\x41');
	//转义字符
	//----------------------------------------------------


	//指向const指针和指针为const
	

	return 0;
}